find AS*/* -name '*.zip' -print0 |
xargs -0 -i -n 1 unzip -c {} 'Long/rphost*/*.log' |
sed -r 's/\xef\xbb\xbf//g;/^p_[0-9]+:/d;/^$/d;s/#tt[0-9]+/#tt/g;s/^[0-9]+:[0-9]+\.[0-9]+-[0-9]+,Context,.*Context=/,Context=/;s/,Rows.*=-?[0-9]+//' |
gawk -vORS='<LineBreak>' '{if (match($0, "^[0-9]+:[0-9]+\\.[0-9]+-")) print "\n"$0; else print $0;}' |
sed -r '/^$/d' |
egrep ',DBMSSQL,' |
sed -r 's/^[0-9]+:[0-9]+\.[0-9]+-//;s/,DBMSSQL,.*Sql=/Sql=/' |
tr \" \' |
gawk -F 'Sql=' '{Sum[$2]+=$1; Exec[$2]+=1; if (Max[$2] < $1) {Max[$2] = $1}; if (Min[$2] == 0 || Min[$2] > $1) {Min[$2] = $1}}END{for (i in Sum) printf "%.3f суммарное время (сек); %d количество; %.3f среднее время (сек); %.3f максимальное время (сек); %.3f минимальное время (сек)<LineBreak>-----------------------------------------------------------------------------------------------------------------------------------------------<LineBreak>%s<LineBreak><LineBreak>-----------------------------------------------------------------------------------------------------------------------------------------------\n", Sum[i]/1000000,Exec[i],Sum[i]/1000000/Exec[i],Max[i]/1000000,Min[i]/1000000,i}' |
sort -rnb -t';' -k 1 | sed -r 's/<LineBreak>/\n/g' > DBMSSQL.txt