time cat Long/rphost*/*.log |
perl -pe 's/#tt[0-9]+/#tt/g' |
perl -pe 's/^[0-9]+:[0-9]+\.[0-9]+-[0-9]+,Context,.*Context=/,Context=/' |
perl -pe 's/,Rows.*=-?[0-9]+//' |
sed -r '/^p_[0-9]+:/d' |
sed -r '/^$/d' |
perl -pe 's/\n/<LineBreak>/; s/\xef\xbb\xbf//g; s/^[0-9]+:[0-9]+\.[0-9]+-/\n/' |
egrep ',DBMSSQL,.*Sql=' |
perl -pe 's/,DBMSSQL,.*Sql=/Sql=/' |
tr \" \' |
gawk -F 'Sql=' '{Sum[$2]+=$1; Exec[$2]+=1; if (Max[$2] < $1) {Max[$2] = $1}; if (Min[$2] == 0 || Min[$2] > $1) {Min[$2] = $1}}END{for (i in Sum) printf "%.3f суммарное время (сек); %d количество; %.3f среднее время (сек); %.3f максимальное время (сек); %.3f минимальное время (сек)<LineBreak>-----------------------------------------------------------------------------------------------------------------------------------------------<LineBreak>%s<LineBreak><LineBreak>-----------------------------------------------------------------------------------------------------------------------------------------------\n", Sum[i]/1000000,Exec[i],Sum[i]/1000000/Exec[i],Max[i]/1000000,Min[i]/1000000,i}' |
sort -rnb -t';' -k 1 |
head |
perl -pe 's/<LineBreak>/\n/g' > DBMSSQL.txt